/**
 * * 変数名 = 新しい値と書けば値が変更されます。
 * プログラムは上から順に実行されるので、後に代入された値で変数の中身が更新されます。
 * 変数自身を使って変数を更新することもできます。
 *
 * 省略形:
 * +=, -=, *=, /=, %=
 */

let name = 'にんじゃわんこ';
console.log(name);

// 変数nameの値を"とりずきん"に更新してください
name = 'とりずきん';

// 変数nameの値を出力してください
console.log(name);

/* -------------------------------------------------------------------------- */

let number = 7;
console.log(number);

// 変数numberの値に3を加えてください

number += 3;
console.log(number);

// 変数numberの値を2で割ってください

number /= 2;
console.log(number);
